<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 微信小程序应用设置
    // +----------------------------------------------------------------------


    'appid'=>'wx98125d85c8fb1bfc',
    'secret'=>'30e5c27e0168e99e4a46fa38fb2cda3f',
//    'notify'=>

   // 'appid' => "wx0373daa2a5128130",                    /*微信开放平台上的应用id*/
    'mch_id' => "1489779772",                           /*微信申请成功之后邮件中的商户id*/
    'api_key' => "bb2d801fc71f326f2b47232d1328c995",    /*在微信商户平台上自己设定的api密钥 32位*/

//    'KEY' => 'T34s934IadLs0897jhge43Bsaigafddf', //支付秘钥需要更改成自己的
//
//    'APPID' => 'wx12dd820d8fbf8593', //APPID需要更改为自己的
//
//    'MCHID' => '1420367002', //商户号需要更改成自己的
//
//    'SECRET' => 'b9840976e63916e233d1d380549514a3', //开发者密码需要更改为自己的
    'notify_url' => 'http://anju-test.zwtapp.win:81/zshop/public/index.php/wxpay/H5pay/getNotifyData' /*自定义的回调程序地址*/

//        'appid'=>'wx98125d85c8fb1bfc',





];
